const n=`![](https://yoran-images-1256970527.cos.ap-guangzhou.myqcloud.com/%E6%97%A0%E4%BA%BA%E7%94%9F%E8%BF%98%E5%B0%81%E9%9D%A2.png)

# 无人生还

读书笔记 🌟🌟🌟

相遇中外的一个本鼻祖级侦探小说，可惜很多桥段在还没有看之前就已经在其他作品中看到了。所以这个三个星的评分只是基于现代的背景下。

花了两天的时候看完了阿加莎的《无人生还》这本小说。 第一次听到这位作者是从极限挑战里面类似风声那里面听来的。对这种悬疑，剧情紧迫的电影产生了兴趣。故周日去书市的是看到这本书就迫不及待的买了下来。

本来我也没想到我会看完的。毕竟现在这个电子信息的时代我的大多数时间都是被手机和电脑游戏给充斥了。但是这种书逼一逼自己也能看下去。看来一个良好的阅读习惯确实难养成。言归正传。

这本书的作者阿加莎一生写了 80 余部小说，这个《无人生还》也有英剧版本。她的系列书在英国的销量只在《圣经》和《莎士比亚》之下，可以说是这个世界最畅销的书之一了。看来英国人一直以来都对悬疑的小说感兴趣。比如柯南·道尔，福尔摩斯都是出自英国。这个女人嗨获得了英国女王亲自授予的爵士身份。是一个了不起的作者。书中介绍是这么描述的，即柯南之后最伟大的最伟大的侦探小说作家。厉害了。

小说的开头就分别写了 8 个人来到士兵岛的原因和各自的身份地位，也通过一些细节的描写让人大致了解到了
他们大致的性格特征。也埋下了伏笔。比如邀请他们的人落笔都是不一样的。但是明显又是同一个人。介绍他们期间，也插入了一些人物来增加读者对他们这一行路途将要面对的疑惑。

在士兵岛上面，接待他们的只有一队夫妇，罗杰斯夫妇。罗杰斯夫人整日惊悚的样子一开始就给了这场大屠杀奠定了基调。但是至于为什么罗杰斯夫人会这么恐慌，直到后文都没有给出一个合理的解释。而且从文中能够看出，如果她对这一次雇主对目的有所了解，那么有大把时间可以跑了。唯一对解释就是她和丈夫杀害的人让他感觉到了无比的愧疚，终日生活在恐慌之中。可以是我觉得力度还是不够。作者应该在加上一些描述的。

一行人走到了各自的房间，房间里面都有一首歌谣，这首歌谣是整本书的线索。整本书的脉络都是围绕这首民谣来展开的，在加上大厅上面的十个士兵，分别对应着岛上了十个人，更是增加了悬疑的气氛。

一行 8 人吃过晚餐之后，在阳台闲聊之时候，突然响起的广播，宣告着在场所有人可以的“罪行”。一行人自然是无比恐慌，毕竟这是隐藏在各自心理的最大的秘密。这样被人大庭广众说出来，脸色自然都不好。但是一开始也自然是不相信的。但是当场就躺下了浪子确宣告了这件事情的不简单。已经罗吉斯夫人的昏迷。但是这个时候也只是增加了一些紧张的氛围，毕竟浪子的死很有可能是自杀，而罗杰斯夫人的晕倒梗有可能说明广播说的是真的，所以罗杰斯夫人在重压之下晕倒也正常不过了。

随着故事的展开，一个个人的罪恶，每个人丑陋的一面都渐渐展现了出来。只要一个人用文字认罪了，那么这个在文中就活不久了。就是下一个死去的士兵。 退休的将军麦克阿瑟在自己死前就已经有了死志，人也老了，完全沉寂在自己的孤寂当中。所以他自然成为了第三个死去的士兵。这可能对他而言甚至是一种解脱。但是将军的死亡是由于外力撞击而死的。这个时候三人都是被谋杀就不言而喻了。事情付出水面，这座岛上有一个杀人狂。

大家非常的紧张，而经过三个男生地毯式的搜索却怎么也搜索到岛上还有第 11 个人。所以结论暂时可以得出，杀人犯就在剩下的 7 个人当中。这个时候，在这 7 个人之间除了产生了猜疑。

随着一个个人的死亡，整个故事完全对应这歌谣。

读者在读的过程中，完全没有想到谁会是下一个要死的人。也不知道他们会怎么死。每个人死得都是那么合理。这里说的合理不是类型国产片中的作死。节奏很快，一个接着一个的倒下，又没有什么明显破绽。让人有一种 i 想一口气读完的感觉。

直到最后秘书维拉上吊自杀为止。整部小说完全回应了小说的标题，无人生还。但是凶手是谁，怎么杀人的。什么时候杀人的。这个时候我就在想，如果凶手是这十个人之外那就没有意思了。果不其然，作者通过一个莫名其妙的理由说出了真相。

却让人不这么舒服。我个人觉得这本书有点言过其实。 但是每一处都写的滴说不漏，没有楼口，坑挖得很好，但是最后说出坑怎么挖的时候却觉得又有点生硬。《无人生还》
`;export{n as default};
