const n=`![](https://yoran-images-1256970527.cos.ap-guangzhou.myqcloud.com/%E6%8C%AA%E5%A8%81%E6%A3%AE%E6%9E%97.jpg)

# 📖《挪威的森林》读后感

看完挪威森林，不是非常的理解村上春树到底想写些什么东西。 看得时候，总觉得这些文字好像对不起准诺贝尔文学奖的人写的文字。不是那么让人经验，故事也不怎么吸引我。最重要的是我没怎么看懂。

但是冲着作者的名气也决定看完。还有最重要的理由就是文字足够短，看完应该会很有成就感。

在看到木月自杀之后，有句话让我下定决心看完它。很有逼格。

生和死不是相互独立的，死就是生的一部分。

不是很理解这句话。但是就是不懂，太显的有逼格。
看完全文之后，想来这句话就是村上春树这片文字的想要表达的东西。

这篇文章把做爱写的很多。或许称之为性交。主角和女友的做爱，和直子的做爱，和十来个女生的性交，还有永泽互换性伴侣的情节。 其中描写性交场面最详细的就是直子的初夜，是通过直子最后自杀前对玲子的口述，还有一个就是最后和玲子为直子释怀的性交，一晚上干了四次。作者莫不是在吹牛逼吧。

感觉书中的人物对于性交这件事情看得非常的习以为常。性交是和爱情分割开来的。有时候又对于性交非常的保守，但是却可以口交……我的天，这是不是就是日本人的现状。身体的背叛不是背叛了么。里面全是大男子主义的东西。

村上春树或许不是什么好鸟，整个故事都是靠着性交来推动的。

里面人物之间的联系都是靠着写信来维系的。我在想，回复一些话留言等几个星期，这是不是太久了。那个年代的人活着是不是觉得时间很快呢…………但是感情却很深。

故事中出现了，我即渡边，木月，直子，绿子，玲子，永泽，永泽女友，行事怪异的敢死队。 故事发生在我的高三到大三期间。

故事又木月的死展开的。由于对于日本文化的不了解，很多的小细节我应该都没有看懂。

木月和我还有直子，除了我，木月和直子都是神经病，或者都有忧郁症。木月和直子青梅竹马，除了没有进入过，什么都干了，后来可知，直子的手活和口活都不错。

我是直子和木月感受到还和这个世界有关联的一个枢纽，这个也是我的最重要的能力。本来我和直子是靠着
木月来有所联系的，木月是一个聪明的人，就是有忧郁症。

故事的转折发生木月自杀，我心情郁闷。然后由于我和直子都有这么一个共同的记忆，所以我和直子真正认识，连续和直子学会几个星期之后，成功推倒直子。这个也是直子的初夜，直子虽然和我上床，给我口交，给我手叫，但是不爱我。可能是由于我是世上对于木月的延续。直子从来没有爱上过我。最后自杀前烧掉我对她的信也能够看出来。

后来直子由于神经病住进了疗养院。在这过程中，出现了敢死队这个人物，这个人物是我和姑娘聊天的必备的人物。搞笑。敢死队走了以后，出现了一个牛逼人物，永泽，很有能力，和善于交际，对于世界的看法也和别人不一样。但是他唯独喜欢和我交朋友，就是因为我和他一样。
本质上都是一个自私的人，不会在意别人对自己的看法，做自己想做的。
但是对于这一点，我还声称自己其实是在意别人怎么看自己的，但是没有这个能力去改变别人的看法，所以索性放弃。

这个或许就是我和永泽的最大的不同。

永泽带着我到处操逼。

第二个转折点，我知道了直子的行踪，去了疗养院了。有了地址就相互交代自己的行踪，在这个过程中，我认识了绿子。一个也不怎么正常的姑娘，有了男朋友还和我出来鬼混。
第三个转折点，就是直子病情加重到自杀。我确认了和绿子的关系。
`;export{n as default};
