const n=`---
date: 2026-05-13T12:00:00
---

【封面图】
![314](/obsidian-sync/%E4%BA%BA%E6%98%AF%E8%A7%86%E8%A7%89%E5%8A%A8%E7%89%A9/Camera_1040g0k031vti79jtk8005pb9g60864ond3in1so.jpg)
风云变幻，这张图前段时间还是把 CodeX 给踢一脚踢开的，全民都在狂热的吹捧 Claude Code。但是，Claude Code 的最新的模型拉了之后，CodeX 的 GPT 5.5，就可以说吧，在我的推送文流当中，已经超过了Claude Code。

【每天肯定自己的小进步】
1. 主动去揽活了，这个行为在我的职业生涯里其实很少出现。我不是一个特别有野心的人，所以过去一般不会主动把事情揽到自己身上。但这次主动去做之后，明显感觉工作的活力被带起来了，人也更进入状态。把事情想清楚、整理好之后，再提交给主管确认。

【今日份阅读启发】
see more: https://mp.weixin.qq.com/s/7RP2BtB3Eqmkqs1daD4cSA

人类是视觉的动物。看到这个文章更加深入了我这个认知。其实跟我之前聊过的一个问题是正相关的，应该就是前几周，有一个说法就是 GUI 的时代已经过时了，现在大家都在 CLI 的一个时代。我对这句话其实一开始觉得，从第一性原理，可能是错误第一性原理认知，我觉得是对的。GUI 可能真的要过时了。比如说我要点个外卖，我想要吃的是外卖，我干嘛还要去选择卖家，然后滑动操作，看各种各样的挑选。我觉得这个不是我最终目的，我最终的目的是吃个外卖。

但是这篇文章给我的感觉就不一样。人依旧是视觉的动物，我们男生依旧是喜欢漂亮的女生，依旧喜欢18岁的女生，不管是多少时候，是吧？当然你年纪大的女生，她有她年纪大的一个美感，但是你不能丑。丑的话，你管你是多大年纪，你也是不喜欢的。所以人就是视觉的动物，主要是视觉的动物。

所以 GUI 它不会消失，它只能说 GUI 的形式将会有悖于传统的形式。就拿刚刚我举外卖这个例子，我的最终目标虽然是点外卖，但是我在点外卖的时候，如果我想要通过 AI 来问它，我今天想吃什么，你帮我点。你说慢慢吧，这过程中我会损失多少东西？我没有看到那些花花绿绿的图片，那些引我胃口的图片，我这顿外卖它真的能吃得香吗？如果 AI 给我下的决策，它确实能实现帮我下外卖，但如果 AI 帮我下这个决策，它不是我最终想要的呢？这对吗？

人依旧是需要视觉的反馈的。当然我们的现在的发起点可能不在于交互了。交互可能是不需要这么繁琐了，对吧？我们整天在聊交互，如何让用户更加快地实现它的目的，或者说在用户交互软件的过程中，帮我们引流一些商业的东西，提高我们整个软件一个商品的价值。但现在不需要，现在有了 agent 这个东西之后，用户想要达到目标非常简单。但是前提是用户得知道他的目标是什么，这样他才不会后悔。而我们如何让他达到这样的目标呢？还是需要通过一些视觉引导他去。对吧，不是所有人都是程序员，不是所有人都是极客的，不是所有人都能面对一个终端，看了一整天终端那些文字的。人类需要一些美，需要一些五颜六色，需要一些好看的动画来辅助我们。这两天我最大的一个感悟。
`;export{n as default};
