const n=`# 年近 30，一事无成

年近 30，一事无成。2022 过得依旧那么凄惨。如果时间线再往前扩展十年，真的是日子越过越难，生活更是没有起色。 每次都以为是低谷，没想到只是我年轻了，才刚开始而已。

**旧的问题，尚未解决；新的难题，接踵而至。**

作为一个低欲望的人，我把一直都想不通为什么我的生活会这么糟糕。身无分文，更不用提什么存款，车的，不存在的。甚至有时会吃饭都成问题。

下面是我今年的一些生活重点。

## 从南宁到深圳

### 南宁的日子

![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/97fe66eb81d444a8967f28feaa13991c~tplv-k3u1fbpfcp-zoom-1.image)

工作方面。从南宁到了深圳。从电动车之城来到了大湾区中心。作为一个柳州人，对于南宁的感情很复杂，肯定不会喜欢。但是做这一行，在广西也就南宁还有一点企业。

当初刚从北京来到南宁的时候，第一印象：

- 和北京相比不遑多让的高楼大厦
- 更新更快的地铁
- 更宽的道路
- 更便宜的篮球场馆
- 当然还带着直逼北京的物价（不算北京 CBD）。
- 房租 500 一个月，大单间

这物价怎么说呢？我在北京村里面能够吃到加肉的面 10 块钱吃得饱饱的。南宁的城中村可不行，物价和外边根本没差别。

在南宁，我每个月刚刚过万的工资，其实过得也还不错。想吃什么吃什么，基本不用看价格。虽然公司加班的强度更甚京城的。但是总体来说还算过得比较恰意的。

![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/6e1f94b74f324294a403680f71ef7066~tplv-k3u1fbpfcp-zoom-1.image)

再结个婚生个小孩，日子也不是不能过下去。可惜，天不遂人愿。奶奶中风了。当初我从北京回到广西，也是为了陪伴白发送黑发的奶奶，而且把黑发都给送走了。现在为了奶奶，手上刚存的点小钱全消耗完了。而且为了因对之后的费用。我不得不再次把目光投向了北上广深。

### 四月份的深圳

第一选择北京，北京本想靠内推，结果经济情况着实不好，内推的公司全都停止招聘，开始裁员了。反倒是自己在深圳投的公司，陆陆续续有了面试的邀请。两地一共投了 120 家公司，总共收获了 24 份面试。比我三年工作经验反馈的比例可少太多。

哦，原来寒冬真的来了。

远程面试很有意思，很多面试官只要你出镜，他自己不出镜，弄得我老走神。聊着聊着，看不到对方的表情，总感觉对方不在听，自己心思已经到了外边的篮球场了 。

面试结果有遗憾也有顺利的。总的来说，3 月底敲定去向。4 月初就到了深圳湾红树林附近了。

![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/b5aa154724bf4b1c98ccbdc183acfb82~tplv-k3u1fbpfcp-zoom-1.image)

毕竟是一线城市，和南宁相比：

- 更高的物价
- 2300 一个月的小单间
- 好窄的路
- 发达的地铁

这些没啥好说的，意料之中。从生活成本来说，深圳比南宁高很多。其他方面，对于我个人而言，差不多，依旧能够找到自己喜欢吃的东西，依旧能够找到篮球场，还是有不少朋友同学在深圳。

变化最大的肯定就是薪资了，税前月薪涨幅将近了 300%，总包由于年终多了 两个月，涨幅更高。

拿到手的钱相比那些生活成本，没有回广西的理由。如果能一直拿这个薪水的话。而且也是少有了下班能够看到太阳。原来 6 点半就下班，晚上的时候相当的多的。自己在家忙了半天，感觉应该已经 11 12 点的样子。实际才 8 点钟。打游戏都能打到无聊。

当然最近还是要加班到 8 点多，总算让自己没有忘记是做开发的。

- 高很多的薪资
- 相比南宁更加轻松的工作压力

都说二线城市工作压力小，我也不知道怎么回事。南宁的就业体验很糟糕。老板觉得给了你钱就能够使劲造你了

## 从 Flutter 到 Vue

![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/20cee4be5b2346cb847333cddd85c8ea~tplv-k3u1fbpfcp-zoom-1.image)

技术方面。今年从开发原生 APP 到了使用 Vue 开发网页。Flutter 开发体验相当的舒服，是那样能够让你自愿加班的舒服，会写上瘾的。

- 也面妙级的更新。和 RN 残废热更新，总是需要摇一摇相比，一天下来对手腕放松不少
- 声明式 UI 编写方法更加的直观。类比 CSS 的各种属性都完全面向对象化，没有切割的感觉。原来界面还能这样子写。

不过，有一个很重要的问题，就是 flutter 说是跨平台的。但是你不会原生开发的话，太多东西做不了，IM 系统，直播系统，人脸识别的 SDK。这些东西都是原生开发的。所以你需要需要会简单的原生语言桥接这些 SDK。

遗憾的是，不管 Flutter 怎么样，在看深圳的公司的时候，发现 flutter 的岗位薪资并不能满足我的需求。所以为了钱，依旧选择了投递 Vue 的岗位。

Vue 这个技术栈，在此之前接触过半年的时候。临时背背一些概念就直接去面试了。还好的是，面试基本还是围绕着 JS 基础，然后到各种业务的解决办法。到也顺利让我混过了不少面试。

相对于 Vue,我更加熟悉的是 React，在开发 Flutter 之前，就是负责的 RN 的开发。

不知道谁说的 Vue 更加的容易上手，我进公司之后，感觉举步维艰。不知道为啥这玩意儿怎么会有这么多概念。

不过还好熬过来了。

## 从小团队到大团队

![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/3a34747dd93d47de8a6d6d408348860c~tplv-k3u1fbpfcp-zoom-1.image)

从工作伙伴上说。从小团队到了大团队。

才真正的理解了那些大佬为什么建议应届生不要加入小公司，要去大厂了。

可惜当初我是没得选。菜鸟是没有选择权的。能够有公司“收留”就很不错了。**即便是第一家一共三个人的公司，我也只能选择去，不然就只能在北京卖房了。**

![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/2ca3b1570e474321b8e710e53f57e28d~tplv-k3u1fbpfcp-zoom-1.image)

从小团队到大团队，给我带来最大的感触，**就是为什么事情这么容易就办成功了。** 一个大的需求，你一点我一点，两周之后一合并，居然就完成了。在这期间你只有关注于自己的代码就行。

### 开会：是完全听不懂的

开会，完全听不懂，领导时不时夹杂的英文，加上各种闻所未闻的名词。什么是迭代，什么是缺陷，哦，原来 BUG 可以叫做缺陷的。codereview 是什么？PR 是什么？MR 是什么？last day 是啥？deadline 是啥？敏捷开发是啥？瀑布开发是啥？

领导还喜欢提问刚来的员工，每次问到我有什么意见。我都只想说，我想拉屎。

痛苦了几个月之后，开会的椅子才算坐得稳了。

### 写代码：专注于提升质量

领导给我的第一个长期任务，就是提高团队的代码质量。

我觉得这个有点可笑。我没写一行代码，没有文档在旁边就写不下去的人。其他兄弟姐妹可都干了好几年的 Vue 了。

没办法，为了不丢人。每天下班都回去看开源项目，看书。

把 GIthub 前几页的开源 vue 项目都看了一个遍，把《重构》《编写可读代码的艺术》《代码整洁之道》都翻了一个遍。

拿到三个需求，三次都用不同的想法来写，为了实现 vue 的最佳实践。

现在，可能也只能说勉强跟上伙伴们的步伐。万万不敢说提升了什么什么质量。

在提升自己之余，全身心加入了代码审查当中，每一个代码合入都看，都评论。坚持两周举办一次技术分享会。不敢说多有成效，只能说无愧于心了。

### 外包兄弟姐妹：卧虎藏龙

我不知道大家对于外包是个什么印象。在来这家公司之前，我觉得进了外包就意味着人生就已经完蛋了。就和在我读书的时候，觉得 30 岁的人都死后已经半截身子埋土里一样，直到自己将近 30 岁，才觉得自己依旧是少年。

每天和外包兄弟们一起工作，加上参与了外包的面试，才了解到这些信息：

- 薪资：这些外包兄弟的工资，每个月到手的，加上周末加班的加班费。分分钟超过同阶别的内部伙伴。内部的周末只有调休 🙃。
- 解决问题的能力：需求分配下去，咔咔两天就提交代码了。很多人的水平比我之前公司的兄弟高太多。
- 定位问题的能力：我还没有找到代码在哪里，兄弟已经解决。
- JS 基础：我们组的一个外包兄弟 JS 的基础让人感觉到诧异，真的很强，我认为他这样的人去面试腾讯字节的基础面试完全没有问题

当然不是所有人都是这样，只能说确实是存在这样的人在。他们唯一差的地方就是学历。

也没啥为他么可惜的，拿的钱不少，压力却不大。每天只能关注自己手上的任务，没有人动不动来找开会，说一些你一知半解的东西。

## 前面怎么走

很明显的感觉到大环境的恶劣。面试更加的卷，所谓的卷，就是以前你需要要会 abc 就可以通过面试了， 现在需要 a 到 h 了。这确实是现状，这次出来面试，不管大小公司，居然都问到了算法，这可是前端耶！！！

现实确实如此，但是也不应该整天怨天尤人。你尽力了么？你真的去努力了么？

都还没有尽力，就整天说环境怎么怎么样。这样的人是真的 low。

![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/3fe1c949d69d41e2af2a0a0b4d7b6571~tplv-k3u1fbpfcp-zoom-1.image)

对于中国未来的经济我是保持乐观状态的。

对于我自身的生活，我依旧保持悲观。

我不敢去面对我接下来可能会碰到的事实。说着是为了给奶奶治病来深圳，更何尝不是在逃避，逃避那样的家庭现状。逃避奶奶现在的状态。

我不知道奶奶真的不在的那一天。我工作的的动力在哪里？前面怎么走？我想不到。

我只想要学好英语、做一个 GO 的项目、多输出 Java 相关多文章。
`;export{n as default};
